
# Задайте натуральное число N. Напишите программу, которая составит список простых множителей числа N.

# def Factor(n):
#     Ans = []
#     d = 2
#     while d * d <= n:
#         if n % d == 0:
#             Ans.append(d)
#             n //= d
#         else:
#             d += 1
#     if n > 1:
#         Ans.append(n)
#     return Ans
# print(Factor(int(input())))

# Задайте последовательность чисел. Напишите программу, которая выведет список неповторяющихся элементов исходной последовательности.

# numbers = [1, 1, 2, 2, 3, 3, 4, 4, 5, 5, 6, 6]
# unique_numbers = list(set(numbers))
# print(unique_numbers)


